# -*- coding: utf-8 -*-

import random

synopsis_source=[ #注意：現在のバージョンでは、出現順序が重要です。行の順序を入れ替えると、うまく動かなくなる恐れがあります。
        "#%synopsis_base%",
          "%舞台序盤%。%目的TOP%。%序盤活躍%。%誰TOP%が、%誰TOP%と仲間になり、%どうする%。しかし、%中盤ピンチ%。%どうするTOP%。%決戦準備%。%終盤活躍%。%報酬%。%どうするend%。%エンディング%。<end>",
          "%舞台序盤%。%誰TOP%が、%されるTOP%。 %目的TOP%。%序盤活躍%。%誰TOP%と仲間になり、%どうする%。しかし、%中盤ピンチ%。%決戦準備%。%どうするTOP%。%終盤活躍%。%報酬%。%どうするend%。%エンディング%。<end>",
          "%舞台序盤%。%誰TOP%が、%誰TOP%とともに、%されるTOP%。%目的TOP%。%序盤活躍%。%どうするsubTOP%。そして、%どうするTOP%。しかし、%中盤ピンチ%。%決戦準備% %終盤活躍%。%報酬%。%どうするend%。%エンディング%。<end>",

     #いつ
        "#%舞台序盤%", "%舞台序盤どこTOP%での物語。%災厄%が起こる",
        "#%舞台序盤状況%" , "が%敵%に攻め込まれ%奪われるもの%を奪われる","に%災厄%が発生する","で、%大切なもの%を破壊される",
        "#%災厄%","戦争","異常気象","疫病","アクシデント","初見殺し","ラスボスの仕掛けたトラップ発動","反乱","国家間戦争","異世界との戦争",
                 "実験の失敗","爆発事故","装置の故障",
        "#%舞台序盤どこTOP%","%どこ形容%%舞台序盤どこ%","%舞台序盤どこ形容%%舞台序盤どこ%",
        "#%舞台序盤どこ形容%","","剣と魔法の","戦国","幕末の","神話と伝承の",
                          "ＡＩに支配された","人がVR空間で生活するようになった",
                          "%魔族%に支配された","人が人体改造されてロボット化された",
                          "労働参加率が低下した","テクノロジーが失われた",
                          "高度に発達した","暴力のはびこった",
                          "宗教が高度に発達した完璧な",
                          "文明が退化した","文明が滅んだ",

        "#%舞台序盤どこ%","世界","ゲーム世界","中世ヨーロッパ",
                       "ヨーロッパ","ユートピア","デストピア",
                       "ファンタジー世界",
                       "電脳世界","異世界","仮想世界","古代文明の世界",
                       "天国","地獄","エデンの園","オープンワールド",
                       "乙女ゲー世界","未来世界","未来社会",
                       "末期の日本",

        "#%序盤活躍%","%アドバンテージ%を使って危機を回避する","%噂%という噂が広まる",
        "#%アドバンテージ%","この世界の知識","%スキルTOP%","「%全形容%」%開発アイテム%",

        "#%目的TOP%","%ミッション%","元の世界に戻るための情報を探す","ハーレム作りを目指す",
                    "%職業%として生きる決意をする","スローライフを目指す","王都を守る騎士となる",
                    "%敵%を倒すことを決意する","この世界の危機を救うことを決意する",
                    "この世界の謎を解くために旅に出る","復讐を決意する",
                    "強くなるために修業の旅に出る","食料を得るために旅に出る",
                    "あてもない旅を始める","%サイドキックTOP%を助けるため旅に出る",
                    "%ヒロインTOP%を助けるため旅に出る","%敵TOP%のアジト壊滅を決意する",

        "#%噂%","救世主が登場する","世界が滅びる","終末の日(ラグナロク)が近い",
                "封印されていた魔王が復活","狂暴な%敵TOP%が現れた",


        "#%中盤ピンチ%","%大切なもの%を失う","%ヒロインTOP%と敵対する",
                    "%サイドキックTOP%に裏切られる","%開発アイテム%を破壊される",
                    "%牢獄%に閉じ込められる","%ヒロインTOP%に裏切られる",
                    "%ヒロインTOP%を奪われる","%どこTOP%に閉じ込められる",
                    "死亡フラグが立つ","%ヒロインTOP%が生贄にされる",
                    "死刑を宣告される","奴隷落ちする",
                    "魔法で幼児化させられる","魔法で%呪い%させられる",
                    "アカウントを停止される","偽物と対決する",

        "#%呪い%","%誰%","%魔物%化","混乱","幻惑","恐慌","魅了","毒化",
                    
        "#%牢獄%","牢獄","別の次元","謎の空間",

        "#%決戦準備%","神様から%ラストアイテムTOP%をもらう","%ヒロインTOP%に告白する",
                     "%ヒロインTOP%の愛を得る","%サイドキックTOP%に最強技を教わる",

        "#%終盤活躍%","%ラストアイテムTOP%を使って%決戦場%で%敵TOP%を倒す",
                     "%奪われるもの%を取り戻す",
                     "「%全形容%」コンサートを行う",
                     "%ラストアイテムTOP%を破壊する",
                     "すべてのミッションを達成する",
                     "懸賞金を手に入れる",

        "#%ラストアイテムTOP%","%ラストアイテム形容%「%全形容%」%ラストアイテム%",

        "#%ラストアイテム形容%","","錆びた","闇の","光の","神速の","光る",

        "#%ラストアイテム%","最強スキル","究極奥義","アイテム","伝説の武器","%開発アイテム%",
                       "伝説の書","宝石","歌","恋愛","料理","ストーン","石仏",
                       "コンピュータ","マシン","プログラム","結晶","サイン","言霊",
                       "呪文","霊感","超能力","幻視","第六感","パワー",
                       "玩具","夢","フルパワー","ヴェール","水着","ダイアモンド",
                       "水晶（クリスタル）","チケット","奇書","盾","剣","機械","聖杯",
                       "最大レベル引き上げ","装備スロット持ちの武器","目玉",
                       "魔法の杖","薬","剣","魔導書","魔導船","錠剤(タブレット)",
                       "高性能タッチパネル","秘薬","霊薬(エリクサー)","神薬（ソーマ)",
                       "賢者の石","魔術書","錬金釜","奴隷の首輪","魔法水晶",
                       "%魔族%の血","世界樹の葉(ユグドラシル)","聖剣","魔剣",
                       "妖刀","神剣","自動修復剣","魔法のランプ","葉っぱ",
                       "馬車","帆船","ガレー船","熱気球","飛行艇",
                       "マンドレイク","ユニコーン","ペガサス","フェニックス",
                       "銃","宝珠(オーブ)","指環","護符(アミュレット)",
                       "エクスカリバー","グングニル","ゲイボルグ","トールハンマー",
                       "イージスの盾","ドラゴンキラー","千里眼",
                       "世界樹(ユグドラシル)","リュート","聖水","隕石",
                       "ロストテクノロジー","神の力","像","十字架",
                       "バイブル","経典","啓示","レシピ",
                       "金細工","ガラス細工","魔法陣","スクロール",
                       "手紙","拳銃","マシンガン","戦車","戦闘機","原爆",
                       "鏡",
                       
                       
                       

                       
        "#%報酬%","%ヒロイン%と結婚する","%報酬アイテム%を得る",

        "#%報酬アイテム%","地位と名誉","探していたもの","広大な領地","%チケット%","金銀財宝",
                       



    #どうする
        "#%どうするsubTOP%" , "%どうするsub%",
        "#%どうするTOP%" , "%どうする%",

        "#%されるTOP%","%どこTOP%に召喚される","%キャット%とともに%どこTOP%に転移する","パーティーを追放される",
                    "村を追放される","迫害を受ける","不幸になる","引退する","神様から%スキルTOP%をもらう",
                    "スキル鑑定で無能スキル扱いされる","%敵%にからまれる",
                    "%ヒロインTOP%が仲間になる",
                    "裏切りに会う","神様からギフトを貰う","罠にかかる",

        "#%どうするsub%","%キャットTOP%","%敵TOP%に襲われる","%敵TOP%に殺される",
                     "トラックにひかれる","過労死する","突然死する","転職する","落ちぶれる",
                     "%誰%の精神を乗っ取る","%サイドキックTOP%に助けられる",
                     "%開発アイテム%を作る","%スキルTOP%を進化させる",
                     "魔法をランクアップさせる",
                     "%ヒロイン%に一目ぼれする",
                     "%シナリオ・ボスを倒して%解放対象%を開放する",

        "#%解放対象%","新マップ","新機能","新能力","新しい町",
                     
        "#%どうする%" , "%どこTOP%に転生し%変身後の姿%となる","%スキルTOP%を獲得する","%ミッション%を行う","%依頼%を請け負う"
                     "%敵%を倒す","%ヒロインTOP%を助ける","%スキルTOP%を使って運命と立ち向かい、成長していく",
                     "本気だす","%スキルTOP%を使って富と権力を得る","%スキルTOP%を獲得し%変身後の姿%となる",
                     "正体を隠して%どこTOP%に潜入する","無双する","ハーレムを作る","悠々自適に暮らす",
                     "幸せに暮らす","恋に落ちる","スローライフを楽しむ",
                     "裕福になる","捕らわれていた%ヒロインTOP%を開放する",
                     "%料理%を味わう","%課題TOP%に挑む","%イベント%を楽しむ",
                     "反撃を開始する","%チケット%の束を拾う",

        "#%どうするend%","魔王を倒す","神を倒す","%ヒロインTOP%と結婚する",
                      "主人公は新たな旅に出る","主人公は安らかに息を引き取る",
                      "主人公は死後、神と出会う","%サイドキックTOP%は主人公の活躍を本に記す",
                      "主人公の死後、%ヒロインTOP%は主人公の日記を発見する",
                      "主人公の死後、その英雄譚を読む%誰TOP%","主人公は元の世界に帰る",
                      "主人公は神となる","主人公はこの地への永住を決意する",
                      "この世界の謎が明らかとなる",
                      "主人公は戦いの中、真の%大切なもの%を知る",
                      "%大切なもの%を死守する","革命を起こす",
                      "%敵%に復讐する",

        "#%チケット%","名前変更チケット","性転換チケット","キャラクター設定変更チケット",
                      "職業変更チケット","スキル獲得チケット","転生チケット",
                      "パートナーチケット","最大魔力アップチケット",
                      "最大HPアップチケット",


    #エンディング

        "#%エンディング%", "世界に平和が訪れる","主人公は伝説となる","新たな都市伝説が生まれる",
                      "主人公は新たな旅に出る","主人公は神話となる",
                      "主人公はレジェンドとなる","主人公は隠しボスを探す旅に出る",
                      "組織のリーダーとなる",
                     
        "#%奪われるもの%","%大切なもの%","%ヒロインTOP%","%サイドキックTOP%","%開発アイテム%",
                      "両親","笑顔","記憶","身体","五感","仲間","絵画","書物",
                      "%どこTOP%のコード","音楽","メモ","記録","指輪","テクノロジー","魔法",
                      "宝",
                      
        "#%大切なもの%","重要な魔法のアイテム","世界平和","心","人生","世界のことわり",

        "#%課題TOP%","「%全形容%」%課題%",

        "#%課題%","謎","怪奇","殺戮","殺人","シミュレーション","ハッキング","罠","瞑想",
                 "婚活","サバイバル","懸賞金獲得","お使いクエスト","デイリークエスト",
                 "ウィークリークエスト","採取クエスト","狩猟クエスト","討伐クエスト","探索クエスト",
                 "薬草採取","鉱石採取","猟","漁","城壁の修復","灯台の建設",
                 "聖地巡礼","武器修理","デュエル","攻城戦","ハウジング",

        "#%イベント%","祭り","花火","航海","タイアップイベント","年末イベント","年始イベント",
                   "バレンタインイベント","お花見","七夕","夏休み","海水浴","ハロウィン",
                   "クリスマス","格闘大会","スローライフ","日光浴","潮干狩り","サーフィン",
                   "スキー","釣り","ウミガメの産卵","10連ガチャ","課金クエスト","晩餐会",
                   "舞踏会","夜会","お茶会","競馬","パチンコ","宝くじ","福引",
                   "スピードくじ","お祭り","カードゲーム","カードバトル",

    #だれが


        "#%キャットTOP%","%誰TOP%","%誰形容%%キャット%%キャットどうする%",

        "#%キャット%","子猫","部下","子供","友人","女神","美女","姫様","幼女","ドラゴン",

        "#%キャットどうする%","%死亡原因%から庇って死ぬ","を助ける",

        "#%死亡原因%","強盗","テロリスト","交通事故",

        "#%誰TOP%" , "%誰形容%「%全形容%」%誰%",


        "#%誰形容%" , "37歳の","%どこTOP%に転生した","%変身後の姿%となった",
                    "黒髪の","銀髪の","金髪の",
                    "無職ニートの","ネットゲーム好きの",
                    "人見知りの","ひきこもり","神様のお気に入りの","お年頃の","腹黒",
                    "イケメン","態度がでかい","超有能な","素行の悪い","不幸だった",
                    "金持ちの","黒いマントの","優しい","へっぽこ","素敵な","量産型","セクハラ",
                    "恋する","仮面の","非常識な","%特技%が得意な","%趣味%が好きな",

        "#%特技%","料理","語学","歴史","数学","ダンス","経営学","剣術",
                 "乗馬","刺繍","歌","楽器","おしゃれ","ガーデニング",

        "#%趣味%","料理","ギャンブル","歌","買い物",

        "#%誰%" ,"%ヒロイン%", "%ヒーローTOP%","%職業TOP%","%魔族%","%種族%",
                "高校生","おじさん","オバサン","幼女","OL","父親","悪役令嬢",
                "バニーちゃん","霊","ペット","娘","老人","中学生",



       "#%ヒーローTOP%","%ヒーロー形容%「%全形容%」%職業TOP%の%ヒーロー%",

       "#%ヒーロー形容%","黒髪の","銀髪の","金髪の","器用な","勇敢な",

       "#%ヒーロー%","%ヒーロー＆ヒロイン%","美少年","ハーフエルフ男性","幼馴染男性",
                  "お坊ちゃま","王子様","神","美男子","天才少年","少年","王子","セクシー",
                  "ダークヒーロー","お兄ちゃん",
                  "教師",
       
       "#%ヒロインTOP%","%ヒロイン形容%「%全形容%」%ヒロイン%",

       "#%ヒロイン形容%","黒髪の","銀髪の","金髪の","ピンク髪の","ロリっ子","エルフ耳の",
                     "ボクっ子","ツンデレ","可愛い",
                     "金持ちの","悲しい過去を持つ",
                     "ベタ惚れ","幼なじみの","角の生えた","あほ毛の","天然の",
                     "妹系","闇落ちした","恋した","ゆれる","切ない","お色気","セクシー",
                     "隣の","白翼の","白いワンピースの",

       "#%ヒロイン%","%ヒーロー＆ヒロイン%","%職業TOP%","%種族%女性","美少女",
                  "幼馴染女性","お嬢様","お姫様","女神","美女","天才少女",
                  "少女","赤ちゃん","幼女","姉","妹","王女様","ビーナス",
                  "女教師",

       "#%ヒーロー＆ヒロイン%","赤ちゃん","%職業TOP%",

       "#%サイドキックTOP%","%サイドキック形容%「%全形容%」%サイドキック%",
       "#%サイドキック形容%","","さわやか","イケメン","金持ちの","雑魚扱いされている",
       "#%サイドキック%","%職業TOP%","%魔族%","%種族%","転生者",

    #いろいろ

       "#%変身後の姿%","%魔族%","%職業TOP%","赤ん坊","%種族%",

       "#%スキルTOP%","%スキル形容%「%全形容%」%スキル%",

       "#%スキル形容%","","過激な","神速の","闇の","魅惑の","眩しい","天使の","ゆらめく",

       "#%スキル%","女体化の能力","「死に戻り」の能力","謎の職業","召喚術",
                 "無詠唱魔術","高速詠唱","詠唱短縮",
                 "人化","不遇スキル","チートスキル","憑依スキル",
                 "即死・致死スキル","時間停止スキル","能力奪取スキル",
                 "転移スキル","異世界からの物品取り寄せスキル",
                 "成長加速チート能力","スキル習得加速能力",
                 "主人公限定レアアイテム","主人公限定レアスキル",
                 "レベルが爆速で上昇するチート","痛み・苦しさ・恐怖への耐性",
                 "人殺し耐性","生活魔法","着物や刀","日本刀","最強の武器",
                 "大切な友達","かけがえのない仲間","レアな薬草",
                 "魔獣のテイム能力","王女","この世界の秘密",
                 "ヒール魔法","デスルーラ","アルゴリズム","お注射",
                 "執筆スキル","裁縫スキル","栽培スキル","培養スキル",
                 "ワンパン","転生能力","変身能力","召喚術",
                 "復活の呪文","蘇生魔法","ライフ超回復",
                 "MP超回復","能力リセット",
                 "ダッシュボタン","便利ボタン","プレイ時間延長スキル",
                 "アバター","ボイス","レアアイテム入手確率アップ",
                 "硬直(ディレイ)","超クリティカル","超レジスト","超パリィ",
                 "超ノックバック","超モーションキャンセル","超レアドロップ",
                 "モンスター養殖","寄生スキル","鑑定スキル",
                 "ヘッドショット","バックアタック","ヒットアンドアウェイ",
                 "生活魔法","攻撃魔法","防御魔法","回復魔法","補助魔法",
                 "支援魔法","召喚魔法","空間魔法","範囲攻撃魔法","範囲回復魔法",
                 "火魔法","水魔法",
                 "無詠唱","光速詠唱","並列詠唱","メニュー発動魔法",
                 "古代語翻訳","チート的魔力","突然変異の遺伝子",
                 "複合魔法","反射(リフレクション)","反撃(カウンター)",
                 "吸収(ドレイン)","魔法無効","詠唱キャンセル",
                 "魔法効果解除(ディスペル)","便利なアイテムボックス",
                 "転送魔法","転移魔法","飛行魔法(上級)",
                 "透明化(インビジブル)","アロー系魔法",
                 "バレット魔法(銃弾)","ウォール系(壁)魔法",
                 "結界魔法","光属性魔法","解毒魔法(アンチドート)",
                 "肉体強化","探知(サーチ)","魔法陣","魔力感知",
                 "幸運力(セレンディピティ)","ナックル","クロー",
                 "瓶の中の手紙","古代文明の破片","馬","魔道具",
                 "聖歌","モンスター養殖スキル","ポーション作成",
                 "部位破壊","マップ共有","マップ分割","ワールドマップ",
                 "オートラン","高強化武器","ブラックリスト","スマホ",
                 "弱体化(ナーフ)","確率操作","フラグ操作",
                 "カバン拡張","自動戦闘","情報抽出","自動マクロ化",
                 "アイテム増殖","乗っ取り(アカウントハック)","倉庫キャラ",
                 "毒","石化","沈黙魔法","忘却魔法","麻痺魔法",
                 "スリープ魔法","天候操作","完全浄化","探知能力",
                 "二刀流","挑発スキル","投げナイフ","体術","盗賊スキル",
                 "五感強化","危険察知","魔力操作","身体強化",
                 "精神強化","思考加速","ハイドスキル","魅了(チャーム)",
                 "吸収(ドレイン)","回復力強化","限界突破",
                 "ゾンビアタック","セーブポイント","図鑑","白魔法","黒魔法",
                 "攻撃無効化","魔法無効化","ロールバック","時間加速",
                 "必殺技","地図",
                 
                 

       "#%ミッション%","町づくり","世直し","下水処理事業","新技開発","薬草栽培","オリジナルソング作曲",
                 "「%全形容%」儀式","「%全形容%」埋葬","河川事業","インゴット作成","造船",
                 "高級食材の調達","錬金釜作成","チュートリアル","火薬作り","武器強化",
                 "修業",
                 
       "#%依頼%","%採取アイテム%採取","%討伐対象%討伐","%捜索対象%捜索",
                 "%任務%",
                 
       "#%採取対象%","薬草","キノコ","鉱石","マンドラゴラ","マンイーター",

       "#%討伐対象%","%魔族%","%ヒロインTOP%","%サイドキックTOP%","巨大モンスター",
       
       "#%捜索対象%","%魔族TOP%","%ヒロインTOP%","%サイドキックTOP%","伝説の聖獣",

       "#%任務%","護衛任務","ダンジョン探索","遺跡探索","アイテム配達",
       
       "#%敵TOP%","%敵形容%「%全形容%」%敵%",

       "#%敵形容%","","チートスキル持ちの","ガラの悪い","腐敗した","私腹を肥やした",
                  "セクハラ","エログロ","闇の","倒せない","残酷な","残虐な","醜い",
                  "邪悪な",
                  

       "#%敵%","%魔族%","%職業TOP%","オーガの大群","悪の王族",
               "追放した者達","貴族","複数人の男","盗賊","教会","国の上層部","ラスボス",
               "ごろつき(ローグ)","殺人鬼","昆虫","悪魔崇拝者","邪教徒",
               "山賊","海賊","邪教徒","聖母","邪神","十二使徒",
               "クイーン","キング","皇帝","ロード","将軍(ジェネラル)"
               "ナイト","アーチャー","魔法使い","反乱軍","魔女",

       "#%決戦場%","%どこ形容%「%全形容%」ダンジョン","%どこ形容%「%全形容%」森",
                  "%どこ形容%「%全形容%」砂漠",
                  "%どこ形容%「%全形容%」惑星",
                  "%どこ形容%「%全形容%」衛星",
                  "%どこ形容%「%全形容%」城",
                  "%どこ形容%「%全形容%」闘技場(コロシアム)",
      
       "#%魔族%","ゴブリン","スケルトン","オーク","オークロード","スライム","トロール",
                "ハイゴブリン","ハイグール",
                "オーガ","人外","吸血鬼","魔物","狼","ドラゴン","ウサギ",
                "バハムート","死神","犬","猫","狼","ライオン",
                "ゴーレム","精霊","夢魔(サキュバス)","ダークドワーフ",
                "ダークエルフ","ウェアウルフ","ウェアラット","コボルト",
                "バジリスク","ディアボロス","竜人族(リザードマン)","ケンタウロス",
                "キメラ","バジリスク","アンデッド","ゾンビ","ウェアキャット",
                "半人半蛇(ラミア)","半人半蜘蛛(アラクネ)","単眼族(サイクロプス)",
                "魚人族(サハギン)","ハーピー","セイレーン","ミミック",
                "ガーゴイル","ミイラ","屍食鬼(グール)","ケルベロス",
                "キマイラ","マンティコア","バシリスク","グリフォン",
                "ミノタウロス","クラーケン","メデューサ","ヒュドラ",
                "ドラゴン","邪神","サラマンダー","リヴァイアサン",
                "サンドワーム","シーサーペント","獣人","クローン",
                
                
                
                

       "#%種族%","ドワーフ","エルフ",'ハーフエルフ',"猫耳族(ケモミミ)","バーバリアン","人族(ヒューマン)",
                "ノーム","フェアリー","フェルパー","妖狐(グッドフォックス)",
                "ハーフエルフ","ダークエルフ","巨人族(ジャイアント)","ハイヒューマン",
                "ハイドワーフ","精霊","妖精","聖獣",


       "#%職業TOP%","%誰形容2%%職業%",

       "#%職業形容%","","高ランクの","美少女","イケメン",

       "#%職業%","魔法使い(ウィザード )","魔術師(マジシャン)","賢者(ワイズマン)",
                "魔女(ウィッチ)","神官（プリースト)",
                "魔法剣士(マジックソードファイター)","砲手(ガンナー)","通り魔","冒険者",
                "聖職者(クレリック)",
                "貴族","ギルドマスター","領主","冒険者","奴隷","王",
                "プログラマー","学生","社畜","会社員","ゲーム運営",
                "廃ゲーマー","リア充","勇者","参謀","王族","豪商",
                "転生者","戦国武将","自衛隊","未来人",
                "裁縫師","家庭教師","庭師","ハッカー","盗賊(シーフ)","追跡者(ハンター)",
                "無職","農民","賢者","女王","戦士(ファイター)","錬金術師(アルケミスト)","ロード",
                "不死者","剣豪","ブレイン","ジャック","暗殺者",
                "エンジェル","霊","人工知能","天使（エンジェル）","大天使(アークエンジェル)",
                "悪魔","サイコパス","亡霊","ニート","神","人形（マシンドール）","メイド","執事",
                "アルバイト",
                "王子","ガーディアン","ウォーリア","パイロット","ミュージシャン",
                "ラスボス","悪魔(デーモン)","ヴァンパイア","リッチ",
                "魔王（サタン)","幽霊","モンスター","モブ","マジックナイト ",
                "マスター","守護者","僧侶","召喚士(サマナー)",
                "女子高生","ロボット","サイボーグ","闘士（ウォーリア","考古学者",
                "魔物使い(テイマー)",
                "商人(マーチャント)","吟遊詩人","建築家","騎士","黒騎士","人形使い",
                "暗殺者(アサシン)","聖者","ドラゴニアン","ケットシー","竜騎士",
                "傭兵","シャーマン","王家の末裔","メカニック","サイキック",
                "狙撃者（スナイパー)","射手(シューター)","弓使い(アーチャー)",
                "剣豪(ソードマン)","陰陽師","祈祷師(エクソシスト)",
                "忍者","巫女(プリーステス)","廃ゲーマー","労働者(レイバー)",
                "哲学者","学者","村人","村長","宿屋の主人","プレイヤーキラー",
                "プレイヤーキラー・キラー",
                "騎士(ナイト)","剣闘士(グラディエイター)","武士(サムライ)",
                "二刀流剣士(ムサシ)","女忍者（くのいち)","回復職(ヒーラー)",
                "付与術師(エンチャンター)","毒士","縄術士","露天商","行商人",
                "数学者","科学者","物理学者","斥候・偵察","密偵(スパイ)",
                "荷物持ち(ポーター)","死霊術師(ネクロマンサー)","聖女(セイント)",
                "剣聖(ソードマスター)","姫騎士(プリンセス・ナイト)",
                "戦乙女(ヴァルキリー)","パラディン(聖騎士)",
                "首長（チーフ)","デュラハン","人工生命体(ホムンクルス)",
                "妖精(フェアリー)","精霊(スピリット)","炎の魔人(イフリート)",
                "羊飼い","漁師","奴隷商人","パン屋","出版社",
                "肉屋","魚屋","理髪店","武器屋","防具屋",
                "雑貨屋","道具屋","薬屋","魔石店","宝石店",
                "服屋","古着屋","八百屋","粉屋","薬草屋",
                "花屋","料理人","鍛冶屋","大工","家具職人",
                "銀細工師","陶芸家","ガラス職人","占い師",
                "バーテンダー","娼婦","ペット屋","酒場の店主",
                "神官","修道士","伝道師","シスター","司祭",
                "酋長","呪術師(シャーマン)","eスポーツプレイヤー",
                "ボット","ゲーム配信者","バグ利用者(チーター)",
                "毒使い","時間操作者","時空操作者","空間操作者",
                "軽業師","医者","超能力者",
                
                

       "#%誰形容2%" , "37歳の","黒髪の","銀髪の","金髪の","赤髪の","緑髪の",
                     "無職ニートの","ネットゲーム好きの",
                     "人見知りの","ひきこもり","神様のお気に入りの","お年頃の","腹黒","イケメン",
                     "態度がでかい","超有能な","素行の悪い","不幸だった","金持ちの",


    #なにを
       "#%開発アイテム%","温泉","ワクチン","%料理TOP%","小説","ハーレム","活版印刷技術",
                      "蒸気機関","永久機関","魔導炉","火薬","エンジン","発電機",
                      "通信手段","飛行機","原子爆弾","コンピューター","高等魔術",
                      "錬金術",
                      

     #どこで

        "#%どこTOP%" , "%どこ形容%%どこ%",

        "#%どこ形容%","","「%全形容%」",
                    "暗黒","隠された","町外れの","都会の","オンライン","人里離れた",
                    "戦時中の","貧困な","魔法の","きれいな","風化した","治安の良い","治安の良くない",
                    "古い","新しい","隔離された",

        "#%どこ%","異世界","学園","王城",
                "ハーレム","ギルド","優しい世界","森","村","教会",
                "国の上層部","国",
                "シャングリラ","アルカディア",
                "キャッスル","学校","天国","地獄","ＲＰＧ","迷宮(ダンジョン)",
                "地下世界","領域","図書館","霊界","星空",
                "海","大陸","山","町","村","火山","洞窟","沼",
                "草原","無人島","島","神殿","ジャングル","畑","街角","オフィス街",
                "摩天楼","水族館","動物園","公園","タワー","仮想世界","宇宙",
                "エルフの谷","エルフの森","安全地帯","地下神殿","塔(タワー)","都市",
                "魔法学校","魔法都市","娼館街","スラム街","孤児院","露店",
                "城門","城塞都市","貴族街","職人街","住宅街","裁判所",
                "街道","深淵(アビス)","砂漠","オアシス","湖","海岸",
                "火口","鉱山","遺跡","宇宙空間","川","泉","雪原",
                "峡谷","山脈","地下遺跡","巨石文明","畑","浮遊島",
                "山頂","王宮","市場(マーケット)","奴隷市場",
                "寺院","祠","墓地","聖都","仮想空間","狩り場",
                "地下牢","未開拓地","植民地","都市国家",
                "港町","漁村","宿場町","鉱山の町","工芸の町",
                "農村","迷宮都市","工業都市","学園都市",
                
                
                
        
    #料理

        "#%料理TOP%" , "%料理形容%「%全形容%」%料理%",
        
        "#%料理形容%", "甘い","おいしい","あたたかい","うま味の",
        "#%料理%", "パン","農作物","オーク肉","ドラゴン肉","ゴブリン肉",
                  "干し肉","スープ","煮豆","クッキー","パイ","シチュー",
                  "リゾット","ふかしイモ","スープ","ビール","クレープ",
                  "ウサギ料理","お茶とお茶菓子",


   #すべてにかかる形容
        "#%全形容%","琥珀色の","明日の","昨日の","朝の","夜の","昼の","激しい","限界の","魅惑の","喜びの",
                   "夜明けの","太陽の","雨の","曇天の","雪の","嵐の","霧の","春の","夏の","真夏の","秋の",
                   "冬の","真冬の","稲妻の","落雷の","時の","時空の","暁の","夕暮れの","薄暮の",
                   "風の","水の","土の","地の","火の","木の","天の","冥王の","海王の","鋼の","鉛の","弾丸の",
                   "空の","大地の","紅蓮の","妖艶の","光の","闇の","白銀の","灼熱の","忘我の","太古の",
                   "森の","湖の","海底","王家の","王族の","最近流行の","闘う","最強の",
                   "氷雪の","放浪の","流浪の","平凡な","未開の","侵略の","浸食の","暴虐の",
                   "不死の","静かな","懺悔の","後悔の","神速の","大地の","銀河の","惑星の",
                   "流星の","火星の","月の","木星の","土星の","冥王星の","天王星の","金星の",
                   "ボス専用","熱い","暑い","冷たい","寒い","苦しい","悲しい",
                   "楽しい","時間の","電子","量子","ホワイト","サブリミナル","メビウス",
                   "ウロボロス","ラプラスの","スマイリー","オトナの","恥じらいの","レイン","キラキラ",
                   "スター","エッチな","おしゃれな","かわいい",
                   "欲望の","悲哀の","片思いの","存亡の","嫉妬の",
                   "眩暈の","モノクロームの","セピアの","悲鳴の","暗闇の","思い出の",
                   "夕暮れの","涙の","魅力の","魔法の","フォレスト","マジック","サウンド",
                   "最強","覇者の","世界最強の","流れ星","とある","燃え尽きた",
                   "ときめき","絶対","こじらせた","アメジストの","氷結の","火炎の",
                   "ブリザードの","ハリケーンの","ファイアストームの",
                   "アイスストームの","サンダーストームの","ダーク","シャドウ","ポイズン","遅すぎた",
                   "天空の","悪魔の","神の","冥府の","聖域の","免罪の","古代の",
                   "炎の","地獄の","砂の","半透明の","屈折の","基本無料の",
                   "攻撃特化の","魔法特化の","回避特化の","防御特化の","回復特化の",
                   "生産特化の","遊び特化の","呪われた","幸運の","空飛ぶ",
                   "裕福な",

                   
]



s_def=[]
s_start=[]
s_num=[]
s_str=[]

def syno_conv():
    global synopsis_source,s_def,s_start,s_num,s_str

    flag_def_start=-1
    count=0

    for s in synopsis_source :
        if (flag_def_start==-1):#定義スタート判定
            if  s!='' :
                if s[0]=='#':
                    flag_def_start=0
        if flag_def_start!=-1:
            if (s!=''):
                if (s[0]=='#'): #ラベル判定
                    s_def.append(s[1:])
                    s_start.append(count)
                    s_num.append(0)
                else: #ラベル以外は抽出用データとみなす
                    s_str.append(s)
                    s_num[len(s_num)-1]=s_num[len(s_num)-1]+1          
                    count=count+1
            else: #nullの場合もラベル以外は抽出用データとみなす
                s_str.append(s)
                s_num[len(s_num)-1]=s_num[len(s_num)-1]+1          
                count=count+1
#    return synopsis_source[0]

syno_conv()

for n in range(1):

    synopsis_base="%synopsis_base%"
    c=0
    syno = synopsis_base

    for s in s_def:
        flag_end=-1
        while flag_end==-1:
            if syno.find(s_def[c])!=-1:
                rep_target= s_str[random.randint(s_start[c],s_start[c]+s_num[c]-1)]
                syno=syno.replace(s_def[c],rep_target,1)
            else:
                flag_end=0


        c=c+1
    print(syno)
